tap "caskroom/cask"
tap "caskroom/versions"
tap "neovim/neovim"
tap "bramstein/webfonttools"

# Shells
#brew install bash
#brew install zsh

# Core Utilities
brew "coreutils"
brew "binutils"
brew "diffutils"
brew "moreutils"
brew "findutils", args: ["with-default-names"]
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "gnu-which", args: ["with-default-names"]
brew "gnutls", args: ["with-default-names"]
brew "grep", args: ["with-default-names"]

# Utilities
brew "wget"
brew "nmap"
brew "ngrep"
brew "htop"
brew "tree"
brew "openssh"
brew "screen"
brew "rsync"
brew "gzip"
brew "unzip"
brew "unrar"
brew "imagemagick", args: ["with-webp"]
##brew "homebrew/x11/xpdf"

#brew install ack
#brew install the_silver_searcher
#brew install z
#brew install ssh-copy-id
#brew install wifi-password
#brew install youtube-dl

# Git
brew "git"
brew "git-extras"
brew "git-flow-avh"
brew "hub"

# Font Tools
brew "woff2"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"

# Editors
brew "nano"
brew "vim", args: ["override-system-vi"]
brew "tmux"
brew "neovim"
#brew macvim --override-system-vim --custom-system-icons

################################################################################
# Brew Cask
################################################################################

cask_args appdir: "/Applications"

# Utilities
cask "iterm2"
cask "cleanmymac"
cask "notion"
cask "imageoptim"
#brew cask install macdown
#brew cask install dropbox
#brew cask install stack
#brew cask install transmission
#brew cask install caption
#brew cask install xld
#brew cask install adapter
#brew cask install exifrenamer
#brew cask install flux
#brew cask install filezilla

# Security
#brew cask install little-snitch
#brew cask install micro-snitch
#brew cask install virustotaluploader
#brew cask install malwarebytes-anti-malware

# Productivity Tools
cask "contexts"
cask "alfred"
cask "bartender"

# Editors
cask "visual-studio-code"

# Media Playback
cask "spotify"
cask "plexamp"
#brew cask install plex-media-player
cask "vlc"
#brew cask install silverlight

# Communication
#brew cask install skype
#brew cask install slack
cask "telegram"
cask "franz"

# Browsers
cask "google-chrome"
cask "google-chrome-canary"
cask "firefox"
cask "firefox-developer-edition"
cask "opera"

# Virtual Machines
cask "virtualbox"
cask "vagrant"
cask "vagrant-manager"
cask "docker"
cask "local-by-flywheel"

# Misc
cask "cakebrew"
#cask "java"
#cask "xquartz"

# Quick Look Plugins
# https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
##cask "betterzipql"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
cask "qlvideo"
cask "provisionql"
cask "quicklookapk"
cask "quicklookase"
cask "quicklook-pat"

################################################################################
# Mac App Store
################################################################################

brew "mas"

mas "Magnet", id: 441258766
mas "Todoist", id: 585829637
mas "Tweetbot", id: 557168941
mas "Memory Clean 2", id: 1114591412
mas "Reeder", id: 880001334
mas "Enpass", id: 732710998

mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
