#  _                        __ _ _
# | |__  _ __ _____      __/ _(_) | ___
# | '_ \| '__/ _ \ \ /\ / / |_| | |/ _ \
# | |_) | | |  __/\ V  V /|  _| | |  __/
# |_.__/|_|  \___| \_/\_/ |_| |_|_|\___|

# ==============================================================================
# TAPS
# ==============================================================================

tap "caskroom/cask"
tap "caskroom/versions"
tap "neovim/neovim"
tap "bramstein/webfonttools"
tap "buo/cask-upgrade"
tap "universal-ctags/universal-ctags"

# ==============================================================================
# HOMEBREW
# ==============================================================================

### Personal/Logitech ###
tap "homebrew/cask-drivers"

# Shells
brew "bash", link: true
brew "zsh"

# Core Utilities
brew "coreutils"
brew "binutils"
brew "diffutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "gnu-which", args: ["with-default-names"]
brew "gnutls", args: ["with-default-names"]
brew "grep", args: ["with-default-names"]

# Command-line Utilities
brew "wget"
brew "nmap"
brew "ngrep"
brew "htop"
brew "tree"
brew "openssh"
brew "screen"
brew "rsync"
brew "gzip"
brew "unzip"
brew "unrar"
brew "make"
brew "less"
brew "imagemagick", args: ["with-webp"]

brew "universal-ctags", args: ["HEAD"]
brew "reattach-to-user-namespace"
brew "ack"
brew "ag"
brew "z"
brew "exa"
brew "bat"
brew "fd"
brew "ripgrep"
brew "ncdu"
brew "tldr"
brew "prettyping"
brew "ren"
brew "shellcheck"

brew "youtube-dl"
#brew install ssh-copy-id
#brew install wifi-password

brew "node", args: ["without-npm"]
brew "yarn", args: ["without-node"]
brew "rbenv"
brew "composer"
brew "python3"

# Editors
brew "nano"
brew "vim", args: ["override-system-vi"]
brew "tmux"
brew "neovim"
#brew macvim --override-system-vim --custom-system-icons

# Git
brew "git"
brew "git-extras"
brew "git-flow-avh"
brew "hub"
brew "diff-so-fancy"

# Font Tools
brew "woff2"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"

# ==============================================================================
# HOMEBREW CASK
# ==============================================================================

cask_args appdir: "/Applications"

# Utilities
cask "iterm2"
cask "notion"
cask "imageoptim"

## Personal ##
cask "fontplop"
cask "rightfont"
cask "sip"

tap "dteoh/sqa"
cask "slowquitapps"
cask "apptrap"
cask "onyx"
cask "xld"
cask "transmission"

cask "dropbox"
#brew cask install macdown
#brew cask install stack
#brew cask install caption
#brew cask install adapter
#brew cask install flux
#brew cask install filezilla

## Personal ##
# Security
cask "little-snitch"
cask "micro-snitch"
#brew cask install virustotaluploader
#brew cask install malwarebytes-anti-malware

# Productivity Tools
cask "contexts"
cask "alfred"
cask "bartender"
cask "istat-menus"
cask "itsycal"

# Editors
cask "visual-studio-code"

# Media Playback
cask "spotify"
cask "plexamp"
cask "vlc"
#brew cask install plex-media-player
#brew cask install silverlight

# Communication
#brew cask install skype
#brew cask install slack
cask "telegram"
cask "franz"

# Browsers
cask "google-chrome"
cask "google-chrome-canary"
cask "firefox"
cask "firefox-developer-edition"
cask "opera"

# Virtual Machines
cask "virtualbox"
cask "vagrant"
cask "vagrant-manager"
cask "docker"
cask "local-by-flywheel"
cask "lando"

# Misc
# cask "cakebrew"
#cask "java"
#cask "xquartz"

# Quick Look Plugins
# https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
#cask "betterzipql"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
cask "qlvideo"
cask "provisionql"
cask "quicklookapk"
cask "quicklookase"
cask "quicklook-pat"

### Personal ###
cask "logitech-control-center"
cask "exifrenamer"

# ==============================================================================
# APP STORE
# ==============================================================================

brew "mas"

mas "Magnet", id: 441258766
mas "Spark", id: 1176895641

mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694

mas "Fantastical 2", id: 975937182
mas "Todoist", id: 585829637
mas "Tweetbot", id: 557168941
mas "Reeder", id: 880001334
mas "Enpass", id: 732710998
mas "Wunderlist", id: 410628904
mas "The Unarchiver", id: 425424353

