#  _                        __ _ _
# | |__  _ __ _____      __/ _(_) | ___
# | '_ \| '__/ _ \ \ /\ / / |_| | |/ _ \
# | |_) | | |  __/\ V  V /|  _| | |  __/
# |_.__/|_|  \___| \_/\_/ |_| |_|_|\___|

# This file is used as a reference for brew formulas which are not (yet) part
# of my base Brewfiles. Formulas listed below are for single use cases or act
# as a reminder to add them to my base Brewfiles later. I know, this file is
# messy.

# ==============================================================================

# Command-line Utilities
# brew "ssh-copy-id"
# brew "wifi-password"

# Logitech Control Center (Unifying Software)
tap "homebrew/cask-drivers"
cask "logitech-options"

# Utilities
# cask "adapter"
# cask "caption"
cask "exifrenamer"
# cask "flux"
# cask "itsycal"
cask "nightowl"
# cask "onyx"
# cask "stack"
cask "xld"

# Apps
cask "calibre"
# cask "macdown"

# Media Playback
# cask "plex-media-player"
# cask "silverlight"

# Communication
# cask "slack"
# cask "skype"

# Browsers
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"
cask "google-chrome-canary"
cask "opera"

# Virtual Machines
cask "docker"
cask "lando"
cask "local-by-flywheel"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"

# Security
cask "little-snitch"
cask "micro-snitch"
# cask "malwarebytes-anti-malware"
# cask "virustotaluploader"

# Misc
# cask "cakebrew"
# cask "java"
# cask "xquartz"
